9/data/attachments/37a7dc840883c186.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_023a720d-da53-4df2-83d6-81a01cdc8840</nif:username>
            <nif:friendToBeAdded>William_reason_Friend_66941_9</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>